tylertms/dspic33e-sim/conformance/rtcc.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "device.h"
#include "dspic33.h"

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} RtccConformance;

enum {
    RTCC_ALARM_VALUE = 0x0620u,
    RTCC_ALARM_CONTROL = 0x0622u,
    RTCC_VALUE = 0x0624u,
    RTCC_CONTROL = 0x0626u,
    RTCC_PAD_CONTROL = 0x0efeu,
    RTCC_PMD_ADDRESS = 0x0764u,
    RTCC_NVM_KEY = 0x072eu,
    RTCC_ENABLE = 0x8000u,
    RTCC_WRITE_ENABLE = 0x2000u,
    RTCC_SYNC = 0x1000u,
    RTCC_HALF_SECOND = 0x0800u,
    RTCC_OUTPUT_ENABLE = 0x0400u,
    RTCC_ALARM_ENABLE = 0x8000u,
    RTCC_ALARM_CHIME = 0x4000u,
    RTCC_PMD = 0x0200u,
    RTCC_IRQ = 62u,
    RTCC_FLAG_ADDRESS = 0x0806u,
    RTCC_ENABLE_ADDRESS = 0x0826u,
    RTCC_PRIORITY_ADDRESS = 0x085eu,
    RTCC_INTERRUPT_BIT = 0x4000u,
    RTCC_VECTOR = 0x0360u,
    RTCC_SEQUENCE_BASE = 0x0400u,
    MOVE_KEY_55 = 0x200550u,
    MOVE_KEY_AA = 0x200aa0u,
    WRITE_NVM_KEY = 0x883970u,
    SET_RTC_WRITE_ENABLE = 0xa8a627u,
    MOVE_DOUBLE_TO_RTC_CONTROL = 0xbe8900u,
    RESET_OPCODE = 0xfe0000u
};

static const uint16_t calendar_masks[4] = {0x7f7fu, 0x073fu, 0x1f3fu, 0x00ffu};
static const uint16_t alarm_masks[4] = {0x7f7fu, 0x073fu, 0x1f3fu, 0x0000u};

static void expect(RtccConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[rtcc-failed] %s\n", name);
    }
}

static bool step_instructions(Dspic33* cpu, uint8_t count) {
    uint8_t index;
    for (index = 0u; index < count; index++) {
        if (dspic33_step(cpu) != DSPIC33_RUNNING) {
            return false;
        }
    }
    return true;
}

static void load_write_enable_sequence(Dspic33* cpu) {
    dspic33_load_program_word(cpu, RTCC_SEQUENCE_BASE, MOVE_KEY_55);
    dspic33_load_program_word(cpu, RTCC_SEQUENCE_BASE + 2u, WRITE_NVM_KEY);
    dspic33_load_program_word(cpu, RTCC_SEQUENCE_BASE + 4u, MOVE_KEY_AA);
    dspic33_load_program_word(cpu, RTCC_SEQUENCE_BASE + 6u, WRITE_NVM_KEY);
    dspic33_load_program_word(cpu, RTCC_SEQUENCE_BASE + 8u, SET_RTC_WRITE_ENABLE);
    cpu->pc = RTCC_SEQUENCE_BASE;
}

static bool authorize_calendar_write(Dspic33* cpu) {
    load_write_enable_sequence(cpu);
    return step_instructions(cpu, 5u) &&
           (dspic33_read_word(cpu, RTCC_CONTROL) & RTCC_WRITE_ENABLE) != 0u;
}

static void enable_clock(Dspic33* cpu) {
    cpu->data[0x0742u] |= 0x02u;
    if (authorize_calendar_write(cpu)) {
        dspic33_write_word(
            cpu, RTCC_CONTROL,
            (uint16_t)(dspic33_read_word(cpu, RTCC_CONTROL) | RTCC_ENABLE));
    }
}

static void configure_interrupt(Dspic33* cpu, uint8_t priority) {
    dspic33_write_word(
        cpu, RTCC_ENABLE_ADDRESS,
        (uint16_t)(dspic33_read_word(cpu, RTCC_ENABLE_ADDRESS) | RTCC_INTERRUPT_BIT));
    dspic33_write_word(
        cpu, RTCC_PRIORITY_ADDRESS,
        (uint16_t)((dspic33_read_word(cpu, RTCC_PRIORITY_ADDRESS) & 0xf8ffu) |
                   ((uint16_t)priority << 8u)));
    cpu->program[(0x0014u + RTCC_IRQ * 2u) / 2u] = RTCC_VECTOR;
    cpu->w[15] = 0x1800u;
}

static bool interrupt_flag(Dspic33* cpu) {
    return (dspic33_read_word(cpu, RTCC_FLAG_ADDRESS) & RTCC_INTERRUPT_BIT) != 0u;
}

static void set_calendar(Dspic33* cpu, uint16_t minute_second, uint16_t weekday_hour,
                         uint16_t month_day, uint16_t year) {
    cpu->io.rtcc.calendar[0] = minute_second;
    cpu->io.rtcc.calendar[1] = weekday_hour;
    cpu->io.rtcc.calendar[2] = month_day;
    cpu->io.rtcc.calendar[3] = year;
}

static void set_alarm(Dspic33* cpu, uint16_t minute_second, uint16_t weekday_hour,
                      uint16_t month_day) {
    cpu->io.rtcc.alarm[0] = minute_second;
    cpu->io.rtcc.alarm[1] = weekday_hour;
    cpu->io.rtcc.alarm[2] = month_day;
}

static bool clock_edges(Dspic33* cpu, uint32_t edges) {
    return dspic33_rtcc_clock(cpu, edges, 0u) && dspic33_device_advance(cpu, 0u);
}

static void reset_access_cases(RtccConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    expect(state, dspic33_read_word(cpu, RTCC_ALARM_CONTROL) == 0u, "ALCFGRPT reset");
    expect(state, dspic33_read_word(cpu, RTCC_CONTROL) == 0u, "RCFGCAL reset");
    expect(state, dspic33_read_word(cpu, RTCC_PAD_CONTROL) == 0u, "PADCFG1 reset");
    expect(state, !cpu->io.rtcc.alarm_output && !cpu->io.rtcc.pmd_disabled,
           "RTCC runtime reset");
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, UINT16_MAX);
    expect(state, dspic33_read_word(cpu, RTCC_ALARM_CONTROL) == UINT16_MAX,
           "ALCFGRPT access mask");
    dspic33_write_word(cpu, RTCC_CONTROL, UINT16_MAX);
    expect(state, dspic33_read_word(cpu, RTCC_CONTROL) == 0x07ffu,
           "RCFGCAL protected and access masks");
    dspic33_write_word(cpu, RTCC_PAD_CONTROL, UINT16_MAX);
    expect(state, dspic33_read_word(cpu, RTCC_PAD_CONTROL) == 0x0003u,
           "PADCFG1 access mask");
    expect(state, !dspic33_rtcc_clock(cpu, 0u, 0u), "reject zero RTCC edge batch");
    expect(state, !dspic33_rtcc_output(cpu, NULL), "reject null RTCC output");
}

static void authorization_cases(RtccConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, RTCC_CONTROL, RTCC_WRITE_ENABLE | RTCC_ENABLE);
    expect(state, dspic33_read_word(cpu, RTCC_CONTROL) == 0u,
           "RTCWREN and RTCEN reject unkeyed write");
    expect(state, authorize_calendar_write(cpu), "canonical RTCWREN sequence");
    expect(state, cpu->nvm.key_stage == 0u, "RTCWREN consumes NVMKEY state");
    dspic33_write_word(cpu, RTCC_CONTROL,
                       (uint16_t)(RTCC_WRITE_ENABLE | RTCC_ENABLE | 0x0300u));
    expect(state,
           (dspic33_read_word(cpu, RTCC_CONTROL) &
            (RTCC_WRITE_ENABLE | RTCC_ENABLE | 0x0300u)) ==
               (RTCC_WRITE_ENABLE | RTCC_ENABLE | 0x0300u),
           "RTCWREN permits protected configuration");
    dspic33_write_word(cpu, RTCC_CONTROL, 0u);
    expect(state, dspic33_read_word(cpu, RTCC_CONTROL) == 0u,
           "software clears RTCWREN and RTCEN");

    dspic33_reset(cpu, 0u);
    load_write_enable_sequence(cpu);
    expect(state, step_instructions(cpu, 4u), "advance keys before delayed RTCWREN");
    dspic33_load_program_word(cpu, RTCC_SEQUENCE_BASE + 8u, 0x000000u);
    dspic33_load_program_word(cpu, RTCC_SEQUENCE_BASE + 10u, SET_RTC_WRITE_ENABLE);
    expect(state, step_instructions(cpu, 2u), "execute delayed RTCWREN sequence");
    expect(state, (dspic33_read_word(cpu, RTCC_CONTROL) & RTCC_WRITE_ENABLE) == 0u,
           "delayed RTCWREN rejected");

    dspic33_reset(cpu, 0u);
    load_write_enable_sequence(cpu);
    expect(state, step_instructions(cpu, 4u), "advance keys before multi-cycle write");
    cpu->w[0] = RTCC_WRITE_ENABLE;
    cpu->w[1] = 0u;
    cpu->w[2] = RTCC_CONTROL;
    dspic33_load_program_word(cpu, RTCC_SEQUENCE_BASE + 8u, MOVE_DOUBLE_TO_RTC_CONTROL);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               (dspic33_read_word(cpu, RTCC_CONTROL) & RTCC_WRITE_ENABLE) == 0u,
           "multi-cycle RCFGCAL write cannot set RTCWREN");

    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, RTCC_SEQUENCE_BASE, MOVE_KEY_AA);
    dspic33_load_program_word(cpu, RTCC_SEQUENCE_BASE + 2u, WRITE_NVM_KEY);
    dspic33_load_program_word(cpu, RTCC_SEQUENCE_BASE + 4u, MOVE_KEY_55);
    dspic33_load_program_word(cpu, RTCC_SEQUENCE_BASE + 6u, WRITE_NVM_KEY);
    dspic33_load_program_word(cpu, RTCC_SEQUENCE_BASE + 8u, SET_RTC_WRITE_ENABLE);
    cpu->pc = RTCC_SEQUENCE_BASE;
    expect(state, step_instructions(cpu, 5u), "execute reversed RTCWREN keys");
    expect(state, (dspic33_read_word(cpu, RTCC_CONTROL) & RTCC_WRITE_ENABLE) == 0u,
           "reversed RTCWREN keys rejected");

    dspic33_reset(cpu, 0u);
    load_write_enable_sequence(cpu);
    expect(state, step_instructions(cpu, 4u), "unlock RTCWREN before interrupt");
    cpu->w[15] = 0x1800u;
    dspic33_load_program_word(cpu, 0x0016u, RTCC_SEQUENCE_BASE + 8u);
    dspic33_write_word(cpu, 0x0800u, 0x0002u);
    dspic33_write_word(cpu, 0x0820u, 0x0002u);
    dspic33_write_word(cpu, 0x0840u, 0x0030u);
    expect(state, dspic33_device_service_interrupt(cpu),
           "interrupt after RTCWREN keys");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "execute RTCWREN after interrupt");
    expect(state, (dspic33_read_word(cpu, RTCC_CONTROL) & RTCC_WRITE_ENABLE) == 0u,
           "interrupt invalidates RTCWREN keys");

    dspic33_reset(cpu, 0u);
    load_write_enable_sequence(cpu);
    expect(state, step_instructions(cpu, 4u), "unlock RTCWREN before trap");
    cpu->w[15] = 0x1800u;
    dspic33_load_program_word(cpu, 0x000eu, RTCC_SEQUENCE_BASE + 8u);
    dspic33_raise_dma_collision_trap(cpu);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "execute RTCWREN after trap");
    expect(state, (dspic33_read_word(cpu, RTCC_CONTROL) & RTCC_WRITE_ENABLE) == 0u,
           "trap invalidates RTCWREN keys");
}

static void pointer_read_cases(RtccConformance* state, Dspic33* cpu) {
    uint8_t pointer;
    for (pointer = 0u; pointer < 4u; pointer++) {
        uint16_t expected_pointer = pointer == 0u ? 0u : (uint16_t)(pointer - 1u);
        dspic33_reset(cpu, 0u);
        cpu->io.rtcc.calendar[pointer] = UINT16_MAX;
        cpu->data[RTCC_CONTROL] = 0u;
        cpu->data[RTCC_CONTROL + 1u] = pointer;
        expect(state, dspic33_read_word(cpu, RTCC_VALUE) == calendar_masks[pointer],
               "RTCVAL word read masks selected calendar value");
        expect(state,
               ((dspic33_read_word(cpu, RTCC_CONTROL) >> 8u) & 3u) == expected_pointer,
               "RTCVAL word read decrements RTCPTR once");

