tylertms/dspic33e-sim/conformance/rtcc.c
        cpu->data[RTCC_CONTROL + 1u] = pointer;
        expect(state,
               dspic33_read_byte(cpu, RTCC_VALUE) == (uint8_t)calendar_masks[pointer],
               "RTCVAL low-byte read returns selected calendar byte");
        expect(state,
               ((dspic33_read_word(cpu, RTCC_CONTROL) >> 8u) & 3u) == expected_pointer,
               "RTCVAL low-byte read decrements RTCPTR");

        cpu->data[RTCC_CONTROL + 1u] = pointer;
        expect(state,
               dspic33_read_byte(cpu, RTCC_VALUE + 1u) ==
                   (uint8_t)(calendar_masks[pointer] >> 8u),
               "RTCVAL high-byte read returns selected calendar byte");
        expect(state,
               ((dspic33_read_word(cpu, RTCC_CONTROL) >> 8u) & 3u) == expected_pointer,
               "RTCVAL high-byte read decrements RTCPTR");

        dspic33_reset(cpu, 0u);
        if (pointer < 3u) {
            cpu->io.rtcc.alarm[pointer] = UINT16_MAX;
        }
        cpu->data[RTCC_ALARM_CONTROL + 1u] = pointer;
        expect(state, dspic33_read_word(cpu, RTCC_ALARM_VALUE) == alarm_masks[pointer],
               "ALRMVAL word read handles selected alarm slot");
        expect(state,
               ((dspic33_read_word(cpu, RTCC_ALARM_CONTROL) >> 8u) & 3u) ==
                   expected_pointer,
               "ALRMVAL word read decrements ALRMPTR once");

        cpu->data[RTCC_ALARM_CONTROL + 1u] = pointer;
        expect(state,
               dspic33_read_byte(cpu, RTCC_ALARM_VALUE) ==
                   (uint8_t)alarm_masks[pointer],
               "ALRMVAL low-byte read returns selected alarm byte");
        expect(state,
               ((dspic33_read_word(cpu, RTCC_ALARM_CONTROL) >> 8u) & 3u) ==
                   expected_pointer,
               "ALRMVAL low-byte read decrements ALRMPTR");

        cpu->data[RTCC_ALARM_CONTROL + 1u] = pointer;
        expect(state,
               dspic33_read_byte(cpu, RTCC_ALARM_VALUE + 1u) ==
                   (uint8_t)(alarm_masks[pointer] >> 8u),
               "ALRMVAL high-byte read returns selected alarm byte");
        expect(state,
               ((dspic33_read_word(cpu, RTCC_ALARM_CONTROL) >> 8u) & 3u) ==
                   expected_pointer,
               "ALRMVAL high-byte read decrements ALRMPTR");
    }
}

static void pointer_write_cases(RtccConformance* state, Dspic33* cpu) {
    uint8_t pointer;
    for (pointer = 0u; pointer < 4u; pointer++) {
        uint16_t expected_pointer = pointer == 0u ? 0u : (uint16_t)(pointer - 1u);
        dspic33_reset(cpu, 0u);
        expect(state, authorize_calendar_write(cpu), "authorize RTCVAL word write");
        dspic33_write_word(cpu, RTCC_CONTROL,
                           (uint16_t)(RTCC_WRITE_ENABLE | ((uint16_t)pointer << 8u)));
        dspic33_write_word(cpu, RTCC_VALUE, UINT16_MAX);
        expect(state, cpu->io.rtcc.calendar[pointer] == calendar_masks[pointer],
               "RTCVAL word write masks selected calendar value");
        expect(state,
               ((dspic33_read_word(cpu, RTCC_CONTROL) >> 8u) & 3u) == expected_pointer,
               "RTCVAL word write decrements RTCPTR");

        dspic33_reset(cpu, 0u);
        cpu->data[RTCC_ALARM_CONTROL + 1u] = pointer;
        dspic33_write_word(cpu, RTCC_ALARM_VALUE, UINT16_MAX);
        expect(state,
               pointer < 3u
                   ? cpu->io.rtcc.alarm[pointer] == alarm_masks[pointer]
                   : cpu->io.rtcc.alarm[0] == 0u && cpu->io.rtcc.alarm[1] == 0u &&
                         cpu->io.rtcc.alarm[2] == 0u,
               "ALRMVAL write handles selected alarm slot");
        expect(state,
               ((dspic33_read_word(cpu, RTCC_ALARM_CONTROL) >> 8u) & 3u) ==
                   expected_pointer,
               "ALRMVAL write decrements ALRMPTR");
    }

    dspic33_reset(cpu, 0u);
    cpu->io.rtcc.calendar[0] = 0x1234u;
    dspic33_write_word(cpu, RTCC_VALUE, 0x5678u);
    expect(state, cpu->io.rtcc.calendar[0] == 0x1234u, "RTCVAL write requires RTCWREN");

    dspic33_reset(cpu, 0u);
    expect(state, authorize_calendar_write(cpu), "authorize split RTCVAL write");
    cpu->io.rtcc.calendar[2] = 0x0102u;
    dspic33_write_word(cpu, RTCC_CONTROL, RTCC_WRITE_ENABLE | 0x0200u);
    dspic33_write_byte(cpu, RTCC_VALUE, 0x15u);
    expect(state, cpu->io.rtcc.calendar[2] == 0x0115u,
           "RTCVAL low-byte write updates selected byte");
    expect(state, (dspic33_read_word(cpu, RTCC_CONTROL) & 0x0300u) == 0x0200u,
           "RTCVAL low-byte write preserves pointer");
    dspic33_write_byte(cpu, RTCC_VALUE + 1u, 0x12u);
    expect(state, cpu->io.rtcc.calendar[2] == 0x1215u,
           "RTCVAL high-byte write updates selected byte");
    expect(state, (dspic33_read_word(cpu, RTCC_CONTROL) & 0x0300u) == 0x0100u,
           "RTCVAL high-byte write decrements pointer");

    dspic33_reset(cpu, 0u);
    cpu->io.rtcc.alarm[2] = 0x0102u;
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, 0x0200u);
    dspic33_write_byte(cpu, RTCC_ALARM_VALUE, 0x15u);
    expect(state, cpu->io.rtcc.alarm[2] == 0x0115u,
           "ALRMVAL low-byte write updates selected byte");
    expect(state, (dspic33_read_word(cpu, RTCC_ALARM_CONTROL) & 0x0300u) == 0x0200u,
           "ALRMVAL low-byte write preserves pointer");
    dspic33_write_byte(cpu, RTCC_ALARM_VALUE + 1u, 0x12u);
    expect(state, cpu->io.rtcc.alarm[2] == 0x1215u,
           "ALRMVAL high-byte write updates selected byte");
    expect(state, (dspic33_read_word(cpu, RTCC_ALARM_CONTROL) & 0x0300u) == 0x0100u,
           "ALRMVAL high-byte write decrements pointer");
}

static void transfer_context_cases(RtccConformance* state, Dspic33* cpu) {
    uint8_t alarm;
    for (alarm = 0u; alarm < 2u; alarm++) {
        uint16_t value_address = alarm != 0u ? RTCC_ALARM_VALUE : RTCC_VALUE;
        uint16_t control_address = alarm != 0u ? RTCC_ALARM_CONTROL : RTCC_CONTROL;
        uint16_t* slot;
        dspic33_reset(cpu, 0u);
        if (alarm == 0u) {
            expect(state, authorize_calendar_write(cpu),
                   "authorize transfer-context RTCVAL write");
            dspic33_write_word(cpu, RTCC_CONTROL, RTCC_WRITE_ENABLE | 0x0200u);
            slot = &cpu->io.rtcc.calendar[2];
        } else {
            dspic33_write_word(cpu, RTCC_ALARM_CONTROL, 0x0200u);
            slot = &cpu->io.rtcc.alarm[2];
        }
        *slot = 0x0102u;
        cpu->io.dma_transfer_active = true;
        cpu->io.dma_transfer_width = 1u;
        dspic33_write_byte(cpu, value_address, 0x15u);
        cpu->io.dma_transfer_active = false;
        expect(state, *slot == 0x0115u,
               "internal byte-low transfer context updates RTCC window");
        expect(state, (dspic33_read_word(cpu, control_address) & 0x0300u) == 0x0200u,
               "internal byte-low transfer context preserves RTCC pointer");

        cpu->io.dma_transfer_active = true;
        cpu->io.dma_transfer_width = 1u;
        dspic33_write_byte(cpu, value_address + 1u, 0x12u);
        cpu->io.dma_transfer_active = false;
        expect(state, *slot == 0x1215u,
               "internal byte-high transfer context updates RTCC window");
        expect(state, (dspic33_read_word(cpu, control_address) & 0x0300u) == 0x0100u,
               "internal byte-high transfer context decrements RTCC pointer");

        if (alarm == 0u) {
            dspic33_write_word(cpu, RTCC_CONTROL, RTCC_WRITE_ENABLE | 0x0200u);
        } else {
            dspic33_write_word(cpu, RTCC_ALARM_CONTROL, 0x0200u);
        }
        cpu->io.dma_transfer_active = true;
        cpu->io.dma_transfer_width = 2u;
        dspic33_write_word(cpu, value_address, 0x1231u);
        cpu->io.dma_transfer_active = false;
        expect(state, *slot == 0x1231u,
               "internal word transfer context updates RTCC window");
        expect(state, (dspic33_read_word(cpu, control_address) & 0x0300u) == 0x0100u,
               "internal word transfer context decrements RTCC pointer once");
    }
}

static void calendar_cases(RtccConformance* state, Dspic33* cpu) {
    static const struct {
        uint16_t before[4];
        uint16_t after[4];
    } transitions[] = {
        {{0x0000u, 0x0000u, 0x0101u, 0x0000u}, {0x0001u, 0x0000u, 0x0101u, 0x0000u}},
        {{0x0059u, 0x0000u, 0x0101u, 0x0000u}, {0x0100u, 0x0000u, 0x0101u, 0x0000u}},
        {{0x5959u, 0x0012u, 0x0101u, 0x0000u}, {0x0000u, 0x0013u, 0x0101u, 0x0000u}},
        {{0x5959u, 0x0623u, 0x0131u, 0x0023u}, {0x0000u, 0x0000u, 0x0201u, 0x0023u}},
        {{0x5959u, 0x0023u, 0x0228u, 0x0023u}, {0x0000u, 0x0100u, 0x0301u, 0x0023u}},
        {{0x5959u, 0x0023u, 0x0228u, 0x0024u}, {0x0000u, 0x0100u, 0x0229u, 0x0024u}},
        {{0x5959u, 0x0623u, 0x1231u, 0x0099u}, {0x0000u, 0x0000u, 0x0101u, 0x0000u}},
    };
    size_t index;
    for (index = 0u; index < sizeof(transitions) / sizeof(transitions[0]); index++) {
        dspic33_reset(cpu, 0u);
        enable_clock(cpu);
        memcpy(cpu->io.rtcc.calendar, transitions[index].before,
               sizeof(transitions[index].before));
        expect(state, clock_edges(cpu, 32768u), "schedule calendar second");
        expect(state,
               memcmp(cpu->io.rtcc.calendar, transitions[index].after,
                      sizeof(transitions[index].after)) == 0,
               "calendar advances documented BCD boundary");
    }

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    expect(state, clock_edges(cpu, 16384u), "advance half second");
    expect(state,
           cpu->io.rtcc.prescaler == 16384u &&
               (dspic33_read_word(cpu, RTCC_CONTROL) & RTCC_HALF_SECOND) != 0u,
           "half-second status and prescaler");
    expect(state, clock_edges(cpu, 16352u), "advance to synchronization window");
    expect(state, (dspic33_read_word(cpu, RTCC_CONTROL) & RTCC_SYNC) != 0u,
           "RTCSYNC asserts for final 32 edges");
    expect(state, clock_edges(cpu, 32u), "complete synchronized second");
    expect(state,
           cpu->io.rtcc.prescaler == 0u && (dspic33_read_word(cpu, RTCC_CONTROL) &
                                            (RTCC_SYNC | RTCC_HALF_SECOND)) == 0u,
           "second rollover clears status");

    dspic33_reset(cpu, 0u);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    expect(state, clock_edges(cpu, 32768u), "disabled clock edge batch accepted");
    expect(state, cpu->io.rtcc.calendar[0] == 0u && cpu->io.rtcc.prescaler == 0u,
           "disabled RTCC ignores SOSC edges");
    enable_clock(cpu);
    cpu->data[0x0742u] &= 0xfdu;
    expect(state, clock_edges(cpu, 32768u), "missing SOSC clock edge batch accepted");
    expect(state, cpu->io.rtcc.calendar[0] == 0u && cpu->io.rtcc.prescaler == 0u,
           "missing SOSC stops RTCC");
}

static void alarm_cases(RtccConformance* state, Dspic33* cpu) {
    uint8_t mask;
    for (mask = 0u; mask < 10u; mask++) {
        dspic33_reset(cpu, 0u);
        enable_clock(cpu);
        set_calendar(cpu, 0x3411u, 0x0212u, 0x0810u, 0x0026u);
        set_alarm(cpu, 0x3412u, 0x0212u, 0x0810u);
        cpu->io.rtcc.prescaler = 32767u;
        dspic33_write_word(cpu, RTCC_ALARM_CONTROL,
                           (uint16_t)(RTCC_ALARM_ENABLE | ((uint16_t)mask << 10u)));
        expect(state, clock_edges(cpu, 1u), "advance alarm comparison edge");
        expect(state, interrupt_flag(cpu), "matching alarm raises RTCCIF");
        expect(state, cpu->io.rtcc.alarm_output, "matching alarm toggles output");
        expect(state,
               (dspic33_read_word(cpu, RTCC_ALARM_CONTROL) & RTCC_ALARM_ENABLE) == 0u,
               "single alarm disables after match");
    }

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL,
                       RTCC_ALARM_ENABLE | RTCC_ALARM_CHIME | 2u);
    expect(state, clock_edges(cpu, 16384u), "chime half-second event");
    expect(state,
           (dspic33_read_word(cpu, RTCC_ALARM_CONTROL) & 0x00ffu) == 1u &&
               cpu->io.rtcc.alarm_output,
           "chime decrements repeat and toggles output");
    dspic33_write_word(cpu, RTCC_FLAG_ADDRESS, 0u);
    expect(state, clock_edges(cpu, 16384u), "chime full-second event");
    expect(state,
           (dspic33_read_word(cpu, RTCC_ALARM_CONTROL) & 0x00ffu) == 0u &&
               !cpu->io.rtcc.alarm_output && interrupt_flag(cpu),
           "chime reaches zero and remains enabled");
    expect(state, clock_edges(cpu, 16384u), "chime repeat wraps");
    expect(state, (dspic33_read_word(cpu, RTCC_ALARM_CONTROL) & 0x80ffu) == 0x80ffu,
           "chime wraps ARPT and remains enabled");

