tylertms/dspic33e-sim/conformance/rtcc.c
    for (mask = 10u; mask < 16u; mask++) {
        dspic33_reset(cpu, 0u);
        enable_clock(cpu);
        set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
        dspic33_write_word(cpu, RTCC_ALARM_CONTROL,
                           (uint16_t)(RTCC_ALARM_ENABLE | ((uint16_t)mask << 10u)));
        expect(state, clock_edges(cpu, 32768u), "advance reserved AMASK value");
        expect(state, !interrupt_flag(cpu) && !cpu->io.rtcc.alarm_output,
               "reserved AMASK has deterministic inactive behavior");
    }
}

static void calibration_cases(RtccConformance* state, Dspic33* cpu) {
    uint16_t calibration;
    for (calibration = 0u; calibration <= UINT8_MAX; calibration++) {
        int16_t signed_calibration = (int16_t)calibration;
        uint16_t adjusted_prescaler;
        uint32_t remaining_edges;
        if (signed_calibration >= 0x80) {
            signed_calibration -= 0x100;
        }
        adjusted_prescaler = (uint16_t)(512 + signed_calibration * 4);
        remaining_edges = 32768u - adjusted_prescaler;
        dspic33_reset(cpu, 0u);
        enable_clock(cpu);
        set_calendar(cpu, 0x0059u, 0x0000u, 0x0101u, 0x0000u);
        dspic33_write_byte(cpu, RTCC_CONTROL, (uint8_t)calibration);
        cpu->io.rtcc.prescaler = 32767u;
        expect(state,
               clock_edges(cpu, 1u) && cpu->io.rtcc.calendar[0] == 0x0100u &&
                   cpu->io.rtcc.prescaler == 0u && cpu->io.rtcc.calibration_pending,
               "minute rollover arms RTCC calibration");
        expect(state,
               clock_edges(cpu, 511u) && cpu->io.rtcc.prescaler == 511u &&
                   cpu->io.rtcc.calibration_pending,
               "RTCC calibration waits for edge 512");
        expect(state,
               clock_edges(cpu, 1u) && cpu->io.rtcc.prescaler == adjusted_prescaler &&
                   !cpu->io.rtcc.calibration_pending,
               "signed RTCC calibration adjusts the prescaler");
        expect(state,
               clock_edges(cpu, remaining_edges) &&
                   cpu->io.rtcc.calendar[0] == 0x0101u && cpu->io.rtcc.prescaler == 0u,
               "RTCC calibration adjusts the next-second duration");
    }

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_byte(cpu, RTCC_CONTROL, UINT8_MAX);
    expect(state,
           clock_edges(cpu, 512u) && cpu->io.rtcc.prescaler == 512u &&
               !cpu->io.rtcc.calibration_pending,
           "second zero without rollover does not calibrate");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0059u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_byte(cpu, RTCC_CONTROL, 1u);
    cpu->io.rtcc.prescaler = 32767u;
    clock_edges(cpu, 1u);
    clock_edges(cpu, 511u);
    dspic33_write_byte(cpu, RTCC_CONTROL, 127u);
    expect(state,
           clock_edges(cpu, 1u) && cpu->io.rtcc.prescaler == 1020u &&
               !cpu->io.rtcc.calibration_pending,
           "CAL write before edge 512 affects current calibration");
    dspic33_write_byte(cpu, RTCC_CONTROL, 128u);
    expect(state,
           clock_edges(cpu, 31748u) && cpu->io.rtcc.calendar[0] == 0x0101u &&
               cpu->io.rtcc.prescaler == 0u,
           "CAL write after edge 512 cannot alter completed calibration");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0059u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_byte(cpu, RTCC_CONTROL, UINT8_MAX);
    cpu->io.rtcc.prescaler = 32767u;
    expect(state, clock_edges(cpu, 1u) && cpu->io.rtcc.calibration_pending,
           "minute rollover arms calibration before MINSEC write");
    dspic33_write_word(cpu, RTCC_CONTROL,
                       (uint16_t)(dspic33_read_word(cpu, RTCC_CONTROL) & ~0x0300u));
    dspic33_write_word(cpu, RTCC_VALUE, 0u);
    expect(state, cpu->io.rtcc.prescaler == 0u && !cpu->io.rtcc.calibration_pending,
           "MINSEC write clears pending calibration");
    expect(state,
           clock_edges(cpu, 512u) && cpu->io.rtcc.prescaler == 512u &&
               !cpu->io.rtcc.calibration_pending,
           "cleared calibration cannot adjust the rewritten minute");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0059u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_byte(cpu, RTCC_CONTROL, 1u);
    cpu->io.rtcc.prescaler = 32767u;
    expect(state,
           clock_edges(cpu, 1u) && clock_edges(cpu, 100u) &&
               cpu->io.rtcc.prescaler == 100u && cpu->io.rtcc.calibration_pending,
           "RTCC calibration advances before disable");
    dspic33_write_word(cpu, RTCC_CONTROL,
                       (uint16_t)(dspic33_read_word(cpu, RTCC_CONTROL) & ~RTCC_ENABLE));
    expect(state,
           clock_edges(cpu, 500u) && cpu->io.rtcc.prescaler == 100u &&
               cpu->io.rtcc.calibration_pending,
           "RTCC disable freezes pending calibration");
    dspic33_write_word(cpu, RTCC_CONTROL,
                       (uint16_t)(dspic33_read_word(cpu, RTCC_CONTROL) | RTCC_ENABLE));
    expect(state,
           clock_edges(cpu, 412u) && cpu->io.rtcc.prescaler == 516u &&
               !cpu->io.rtcc.calibration_pending,
           "RTCC re-enable resumes pending calibration");

    for (uint8_t power = DSPIC33_POWER_SLEEP; power <= DSPIC33_POWER_IDLE; power++) {
        dspic33_reset(cpu, 0u);
        enable_clock(cpu);
        set_calendar(cpu, 0x0059u, 0x0000u, 0x0101u, 0x0000u);
        dspic33_write_byte(cpu, RTCC_CONTROL, 1u);
        cpu->io.rtcc.prescaler = 32767u;
        clock_edges(cpu, 1u);
        clock_edges(cpu, 100u);
        cpu->power_state = (Dspic33PowerState)power;
        expect(state,
               clock_edges(cpu, 412u) && cpu->io.rtcc.prescaler == 516u &&
                   !cpu->io.rtcc.calibration_pending,
               "RTCC calibration continues in power-saving mode");
    }

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0059u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_byte(cpu, RTCC_CONTROL, 1u);
    cpu->io.rtcc.prescaler = 32767u;
    clock_edges(cpu, 1u);
    clock_edges(cpu, 100u);
    cpu->data[0x0742u] &= 0xfdu;
    expect(state,
           clock_edges(cpu, 412u) && cpu->io.rtcc.prescaler == 100u &&
               cpu->io.rtcc.calibration_pending,
           "missing SOSC freezes pending RTCC calibration");
    cpu->data[0x0742u] |= 0x02u;
    expect(state,
           clock_edges(cpu, 412u) && cpu->io.rtcc.prescaler == 516u &&
               !cpu->io.rtcc.calibration_pending,
           "restored SOSC resumes pending RTCC calibration");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0059u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_byte(cpu, RTCC_CONTROL, 1u);
    cpu->io.rtcc.prescaler = 32767u;
    clock_edges(cpu, 1u);
    clock_edges(cpu, 100u);
    dspic33_write_word(cpu, RTCC_PMD_ADDRESS, RTCC_PMD);
    expect(state,
           dspic33_device_advance(cpu, 1u) && cpu->io.rtcc.pmd_disabled &&
               cpu->io.rtcc.calibration_pending,
           "RTCC PMD disable preserves pending calibration");
    expect(state,
           clock_edges(cpu, 412u) && cpu->io.rtcc.prescaler == 100u &&
               cpu->io.rtcc.calibration_pending,
           "RTCC PMD freezes pending calibration");
    dspic33_write_word(cpu, RTCC_PMD_ADDRESS, 0u);
    expect(state,
           dspic33_device_advance(cpu, 1u) && !cpu->io.rtcc.pmd_disabled &&
               clock_edges(cpu, 412u) && cpu->io.rtcc.prescaler == 516u &&
               !cpu->io.rtcc.calibration_pending,
           "RTCC PMD re-enable resumes pending calibration");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0059u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_byte(cpu, RTCC_CONTROL, 1u);
    cpu->io.rtcc.prescaler = 32767u;
    expect(state,
           clock_edges(cpu, 1u) && clock_edges(cpu, 100u) &&
               cpu->io.rtcc.calibration_pending,
           "RTCC calibration advances before warm reset");
    dspic33_load_program_word(cpu, 0u, RESET_OPCODE);
    cpu->pc = 0u;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->io.rtcc.prescaler == 100u &&
               cpu->io.rtcc.calibration_pending &&
               (dspic33_read_word(cpu, RTCC_CONTROL) & 0x00ffu) == 1u,
           "warm reset preserves RTCC calibration phase");
    expect(state,
           clock_edges(cpu, 412u) && cpu->io.rtcc.prescaler == 516u &&
               !cpu->io.rtcc.calibration_pending,
           "warm-reset calibration completes at retained edge");

    {
        Dspic33 copy;
        bool initialized = dspic33_initialize(&copy);
        expect(state, initialized, "initialize RTCC calibration copy");
        if (initialized) {
            dspic33_reset(cpu, 0u);
            enable_clock(cpu);
            set_calendar(cpu, 0x0059u, 0x0000u, 0x0101u, 0x0000u);
            dspic33_write_byte(cpu, RTCC_CONTROL, 1u);
            cpu->io.rtcc.prescaler = 32767u;
            expect(state,
                   clock_edges(cpu, 1u) && clock_edges(cpu, 100u) &&
                       cpu->io.rtcc.calibration_pending,
                   "RTCC calibration advances before copy");
            expect(state, dspic33_copy(&copy, cpu), "copy pending RTCC calibration");
            expect(state, clock_edges(cpu, 412u) && clock_edges(&copy, 412u),
                   "advance copied RTCC calibrations");
            expect(state,
                   cpu->io.rtcc.prescaler == 516u && copy.io.rtcc.prescaler == 516u &&
                       !cpu->io.rtcc.calibration_pending &&
                       !copy.io.rtcc.calibration_pending,
                   "copied RTCC calibrations complete independently");
            dspic33_destroy(&copy);
        }
    }

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0059u, 0x0000u, 0x0101u, 0x0000u);
    cpu->io.rtcc.prescaler = 32767u;
    expect(state, clock_edges(cpu, 1u) && cpu->io.rtcc.calibration_pending,
           "RTCC calibration arms before POR");
    dspic33_reset(cpu, 0u);
    expect(state, cpu->io.rtcc.prescaler == 0u && !cpu->io.rtcc.calibration_pending,
           "POR clears RTCC calibration phase");
}

static void interrupt_output_power_cases(RtccConformance* state, Dspic33* cpu) {
    uint8_t priority;
    bool high;
    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    expect(state, clock_edges(cpu, 16384u), "raise enabled RTCC interrupt");
    expect(state, interrupt_flag(cpu) && !dspic33_device_wake(cpu),
           "RTCCIF sets with IEC disabled and cannot wake");
    configure_interrupt(cpu, 3u);
    expect(state, dspic33_device_service_interrupt(cpu), "service RTCC interrupt");
    expect(state, cpu->last_interrupt == RTCC_IRQ && cpu->pc == RTCC_VECTOR,
           "RTCC interrupt uses IRQ62 vector");

    dspic33_reset(cpu, 0u);
    configure_interrupt(cpu, 3u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state, !dspic33_device_wake(cpu), "RTCC IEC without RTCCIF cannot wake");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 0u);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    clock_edges(cpu, 16384u);
    expect(state, !dspic33_device_wake(cpu), "priority-zero RTCC alarm cannot wake");

