tylertms/dspic33e-sim/conformance/rtcc.c
    for (priority = 1u; priority <= 2u; priority++) {
        uint32_t pc;
        uint16_t stack;
        dspic33_reset(cpu, 0u);
        enable_clock(cpu);
        configure_interrupt(cpu, priority);
        cpu->sr = 0x0040u;
        cpu->power_state = DSPIC33_POWER_SLEEP;
        set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
        dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
        clock_edges(cpu, 16384u);
        pc = cpu->pc;
        stack = cpu->w[15];
        expect(state,
               dspic33_device_wake(cpu) && cpu->pc == pc && cpu->w[15] == stack &&
                   cpu->interrupt_count == 0u && interrupt_flag(cpu),
               "low-or-equal RTCC alarm wakes without interrupt frame");
        cpu->sr = 0u;
        expect(state,
               dspic33_device_service_interrupt(cpu) &&
                   cpu->last_interrupt == RTCC_IRQ && cpu->interrupt_count == 1u,
               "retained RTCCIF vectors after lowering IPL");
    }

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 2u);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    clock_edges(cpu, 16384u);
    dspic33_write_word(cpu, 0x0820u, 0x0002u);
    dspic33_write_word(cpu, 0x0840u, 0x0040u);
    dspic33_write_word(cpu, 0x0800u, 0x0002u);
    expect(state,
           dspic33_device_wake(cpu) && cpu->last_interrupt == 1u &&
               cpu->interrupt_count == 1u,
           "concurrent higher-priority IRQ wins wake vector");
    expect(state, interrupt_flag(cpu), "concurrent higher IRQ retains RTCCIF");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 3u);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    clock_edges(cpu, 16384u);
    dspic33_write_word(cpu, 0x08c2u, 0u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               cpu->power_state == DSPIC33_POWER_ACTIVE && cpu->interrupt_count == 0u &&
               interrupt_flag(cpu),
           "GIE-disabled RTCC alarm wakes without vectoring");
    expect(state, cpu->last_interrupt == UINT16_MAX && cpu->w[15] == 0x1800u,
           "GIE-disabled wake leaves control state unchanged");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 3u);
    cpu->disicnt = 2u;
    dspic33_load_program_word(cpu, cpu->pc, 0u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    clock_edges(cpu, 16384u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING &&
               cpu->power_state == DSPIC33_POWER_ACTIVE && cpu->interrupt_count == 0u &&
               cpu->disicnt == 1u && interrupt_flag(cpu),
           "DISI masks RTCC vector while allowing Sleep wake");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->interrupt_count == 0u &&
               cpu->disicnt == 0u && interrupt_flag(cpu),
           "RTCCIF remains pending through final DISI cycle");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->interrupt_count == 1u &&
               cpu->last_interrupt == RTCC_IRQ,
           "retained RTCCIF vectors after DISI expires");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 7u);
    cpu->disicnt = 2u;
    cpu->power_state = DSPIC33_POWER_SLEEP;
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    clock_edges(cpu, 16384u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->interrupt_count == 1u &&
               cpu->last_interrupt == RTCC_IRQ,
           "priority-seven RTCC alarm vectors through DISI");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 2u);
    cpu->sr = 0x0040u;
    cpu->power_state = DSPIC33_POWER_SLEEP;
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    expect(state, clock_edges(cpu, 16384u), "raise equal-priority sleep alarm");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "equal-priority alarm wakes processor");
    expect(state,
           cpu->power_state == DSPIC33_POWER_ACTIVE && interrupt_flag(cpu) &&
               cpu->interrupt_count == 0u && cpu->w[15] == 0x1800u,
           "equal-priority wake retains flag without interrupt frame");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 3u);
    cpu->sr = 0x0040u;
    cpu->power_state = DSPIC33_POWER_SLEEP;
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    clock_edges(cpu, 16384u);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING,
           "higher-priority alarm wakes and vectors");
    expect(state,
           cpu->last_interrupt == RTCC_IRQ && cpu->interrupt_count == 1u &&
               cpu->w[15] == 0x1804u,
           "higher-priority alarm stacks interrupt frame");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 3u);
    cpu->power_state = DSPIC33_POWER_IDLE;
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    expect(state, clock_edges(cpu, 16384u), "advance RTCC alarm while Idle");
    expect(state,
           cpu->io.rtcc.prescaler == 16384u && interrupt_flag(cpu) &&
               dspic33_step(cpu) == DSPIC33_RUNNING &&
               cpu->power_state == DSPIC33_POWER_ACTIVE &&
               cpu->last_interrupt == RTCC_IRQ,
           "RTCC continues in Idle and alarm wakes through vector");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    dspic33_write_word(
        cpu, RTCC_CONTROL,
        (uint16_t)(dspic33_read_word(cpu, RTCC_CONTROL) | RTCC_OUTPUT_ENABLE));
    expect(state, dspic33_rtcc_output(cpu, &high) && !high, "alarm output starts low");
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    clock_edges(cpu, 16384u);
    expect(state, dspic33_rtcc_output(cpu, &high) && high,
           "alarm event drives RTCC output");
    dspic33_write_word(cpu, RTCC_PAD_CONTROL, 0x0002u);
    expect(state, dspic33_rtcc_output(cpu, &high) && high,
           "RTSECSEL selects half-second output");
    clock_edges(cpu, 16384u);
    expect(state, dspic33_rtcc_output(cpu, &high) && !high,
           "seconds output follows HALFSEC");
    dspic33_write_word(
        cpu, RTCC_CONTROL,
        (uint16_t)(dspic33_read_word(cpu, RTCC_CONTROL) & ~RTCC_OUTPUT_ENABLE));
    expect(state, !dspic33_rtcc_output(cpu, &high),
           "RTCOE disables logical output API");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_PMD_ADDRESS, RTCC_PMD);
    expect(state, !cpu->io.rtcc.pmd_disabled, "RTCC PMD disable is delayed");
    expect(state, dspic33_device_advance(cpu, 1u) && cpu->io.rtcc.pmd_disabled,
           "RTCC PMD disable applies after one cycle");
    expect(state, dspic33_read_word(cpu, RTCC_CONTROL) == 0u,
           "RTCC PMD reads module registers as zero");
    expect(state, clock_edges(cpu, 32768u) && cpu->io.rtcc.calendar[0] == 0u,
           "RTCC PMD blocks clock edges");
    dspic33_write_word(cpu, RTCC_PMD_ADDRESS, 0u);
    expect(state, dspic33_device_advance(cpu, 1u) && !cpu->io.rtcc.pmd_disabled,
           "RTCC PMD re-enable is delayed");
    expect(state, cpu->io.rtcc.calendar[0] == 0u, "RTCC PMD preserves calendar state");
}

static void lifecycle_cases(RtccConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    bool initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize RTCC copy");
    if (!initialized) {
        return;
    }

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x1234u, 0x0212u, 0x0810u, 0x0026u);
    set_alarm(cpu, 0x5678u, 0x0311u, 0x0912u);
    cpu->io.rtcc.prescaler = 123u;
    cpu->io.rtcc.alarm_output = true;
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, 0x91a5u);
    expect(state, dspic33_rtcc_clock(cpu, 10u, 2u), "schedule RTCC edges before copy");
    expect(state, dspic33_copy(&copy, cpu), "copy pending RTCC state");
    expect(state, dspic33_device_advance(cpu, 2u) && dspic33_device_advance(&copy, 2u),
           "advance original and copied RTCC");
    expect(state,
           memcmp(&copy.io.rtcc, &cpu->io.rtcc, sizeof(cpu->io.rtcc)) == 0 &&
               dspic33_read_word(&copy, RTCC_CONTROL) ==
                   dspic33_read_word(cpu, RTCC_CONTROL),
           "copy preserves RTCC runtime and registers");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x1234u, 0x0212u, 0x0810u, 0x0026u);
    set_alarm(cpu, 0x5678u, 0x0311u, 0x0912u);
    cpu->io.rtcc.prescaler = 123u;
    cpu->io.rtcc.alarm_output = true;
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, 0x91a5u);
    dspic33_load_program_word(cpu, 0u, 0xfe0000u);
    cpu->pc = 0u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "execute warm reset with RTCC");
    expect(state,
           cpu->io.rtcc.calendar[0] == 0x1234u && cpu->io.rtcc.calendar[3] == 0x0026u &&
               cpu->io.rtcc.prescaler == 123u,
           "warm reset preserves calendar and prescaler");
    expect(state,
           dspic33_read_word(cpu, RTCC_CONTROL) == (RTCC_ENABLE | RTCC_WRITE_ENABLE),
           "warm reset preserves RCFGCAL");
    expect(state, dspic33_read_word(cpu, RTCC_ALARM_CONTROL) == 0u,
           "warm reset resets alarm control");
    expect(
        state,
        cpu->io.rtcc.alarm[0] == 0u && !cpu->io.rtcc.alarm_output &&
            !cpu->io.rtcc.pmd_disabled && cpu->io.rtcc.pmd_generation == 0u,
        "warm reset uses deterministic undefined alarm state and resets module state");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x1234u, 0x0212u, 0x0810u, 0x0026u);
    expect(state, dspic33_rtcc_clock(cpu, 100u, 5u), "schedule RTCC edges before POR");
    dspic33_reset(cpu, 0u);
    expect(state, cpu->events.count == 0u && cpu->io.rtcc.prescaler == 0u,
           "POR cancels RTCC event and clears prescaler");
    expect(state, cpu->io.rtcc.calendar[0] == 0u && cpu->io.rtcc.calendar[3] == 0u,
           "POR clears deterministic calendar state");
    expect(state, dspic33_device_advance(cpu, 5u), "advance after RTCC POR");
    expect(state, cpu->io.rtcc.prescaler == 0u,
           "stale RTCC event cannot advance after POR");

    dspic33_reset(cpu, 0u);
    cpu->device_cycles = UINT64_MAX;
    expect(state, !dspic33_rtcc_clock(cpu, 1u, 1u),
           "RTCC edge scheduling reports overflow");
    expect(state, cpu->events.count == 0u && cpu->io.rtcc.prescaler == 0u,
           "failed RTCC edge schedule leaves state unchanged");
    dspic33_write_word(cpu, RTCC_PMD_ADDRESS, RTCC_PMD);
    expect(state,
           (dspic33_read_word(cpu, RTCC_PMD_ADDRESS) & RTCC_PMD) == 0u &&
               cpu->io.rtcc.pmd_generation == 2u,
           "failed RTCC PMD transition rolls back and invalidates generation");
    expect(state,
           !cpu->io.rtcc.pmd_disabled && cpu->events.count == 0u &&
               cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR,
           "failed RTCC PMD transition preserves effective state");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, RTCC_PMD_ADDRESS, RTCC_PMD);
    dspic33_write_word(cpu, RTCC_PMD_ADDRESS, 0u);
    expect(state, cpu->io.rtcc.pmd_generation == 2u && cpu->events.count == 2u,
           "rapid RTCC PMD toggle queues generations");
    expect(state,
           dspic33_device_advance(cpu, 1u) && !cpu->io.rtcc.pmd_disabled &&
               cpu->events.count == 0u,
           "stale RTCC PMD event cannot override latest state");
    dspic33_destroy(&copy);
}

static void long_sequence_cases(RtccConformance* state, Dspic33* cpu) {
    uint8_t elapsed;
    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    for (elapsed = 1u; elapsed <= 85u; elapsed++) {
        uint8_t expected_second = (uint8_t)(elapsed % 60u);
        uint8_t expected_minute = (uint8_t)(elapsed / 60u);
        expect(state, clock_edges(cpu, 32768u), "advance RTCC long sequence second");
        expect(state,
               cpu->io.rtcc.calendar[0] ==
                   (uint16_t)(((expected_minute / 10u * 16u + expected_minute % 10u)
                               << 8u) |
                              (expected_second / 10u * 16u + expected_second % 10u)),
               "RTCC long sequence calendar value");
    }
}

int main(void) {
    Dspic33 cpu;
    RtccConformance state = {0u, 0u, 0u};
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize RTCC processor");
    if (initialized) {
        reset_access_cases(&state, &cpu);
        authorization_cases(&state, &cpu);
        pointer_read_cases(&state, &cpu);
        pointer_write_cases(&state, &cpu);
        transfer_context_cases(&state, &cpu);
        calendar_cases(&state, &cpu);
        calibration_cases(&state, &cpu);
        alarm_cases(&state, &cpu);
        interrupt_output_power_cases(&state, &cpu);
        lifecycle_cases(&state, &cpu);
        long_sequence_cases(&state, &cpu);
        expect(&state, state.cases == 1479u, "RTCC assertion arithmetic");
        dspic33_destroy(&cpu);
    }
    printf("[rtcc-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    return state.failed == 0u ? 0 : 1;
}
